// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Menus */
"Menu About" = "A Chrome OS képkészítő névjegye";
"Menu Prefs" = "Beállítások…";
"Menu Services" = "Szolgáltatások";
"Menu Hide" = "A Chrome OS képkészítő elrejtése";
"Menu Hide Others" = "Többi elrejtése";
"Menu Show All" = "Összes megjelenítése";
"Menu Quit" = "Kilépés a Chrome OS képkészítőből";
"Menu Window" = "Ablak";
"Menu Minimize" = "Kicsinyítés";
"Menu Zoom" = "Nagyítás/kicsinyítés";
"Menu Bring All To Front" = "Összes az előtérbe";
"Menu Help" = "Súgó";
"Menu App Help" = "A Chrome OS képkészítő súgója";

/* Buttons */
"Button Previous" = "Előző";
"Button Next" = "Következő";
"Button Stop" = "Leállítás";
"Button Done" = "Kész";

/* Tab: Select device model */
"Text Welcome" = "Ez az eszköz lehetővé teszi, hogy helyreállító SD-kártyát vagy USB-memóriát hozzon létre Chrome OS-eszközének visszaállításához.\n\nAdja meg Chrome OS-eszközének modellszámát (pl. SAMS ALEX BETA-US 8738). A számot annak a képernyőnek az alsó részén láthatja, amelyen a rendszer kéri a helyreállító eszköz csatlakoztatását.";
"Text Model" = "Modell:";
"Button Local Image" = "Helyi kép…";

/* Tab: Select USB stick */
"Text Select Prompt" = "Válasszon ki egy cserélhető adathordozót, melyet a helyreállításhoz fog használni:";
"Text Insertion Prompt" = "Kérjük, helyezzen be egy SD-kártyát vagy USB-memóriát.";

/* Tab: Done */
"Text Congrats" = "Az adathordozó készen áll. Most eltávolíthatja a rendszerből, és használhatja a Chrome OS-eszköz visszaállításához.";

/* Sizes */
"Size Bytes" = " bájt";
"Size Kilobytes" = " kB";
"Size Megabytes" = " MB";
"Size Gigabytes" = " GB";
"Size Terabytes" = " TB";
"Size Petabytes" = " PB";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Ez az alkalmazás nem futtatható.";
"NoDiskArb Informative" = "Probléma volt a Disk Arbitration elindításakor. Ennek nem lett volna szabad megtörténnie.";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "Nem lehet lekérni a képek listáját.";
"CantGetConfig Informative" = "Valami probléma lépett fel az elérhető helyreállító képek listájának lekérése során (%1$@). Kérjük, ellenőrizze, hogy van-e hálózati kapcsolat.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "nem sikerült kapcsolatot találni";
"CantGetConfig Error DownloadError" = "hiba történt a letöltés közben";
"CantGetConfig Error StringCreate" = "a válasz nem használható fel";

/* Version error. */
"VersionError Message" = "Az alkalmazás jelen verziója túl régi.";
"VersionError Informative" = "Kérjük, töltsön le egy újabb verziót. Ennek a verziónak a száma: %1$@; de legalább %2$@ számú verzióra van szükség. %3$@";
"VersionError OK" = "Új verzió letöltése";

/* File dialog to select a local file. */
"SelectLocal File" = "Kérjük, válasszon egy képet:";
"SelectLocal Button" = "Kiválasztás";

/* Alert on writing stick. */
"WriteAlert Message" = "Biztosan véglegesen törli a(z) %1$@ tartalmát?";
"WriteAlert Informative" = "A jelenleg rajta található adatok véglegesen el fognak veszni. A művelet nem vonható vissza.";
"WriteAlert Cancel" = "Nem törlöm";
"WriteAlert OK" = "Törlöm";

"TooSmallAlert Message" = "A(z) %1$@ nem használható, mert túl kicsi.";
"TooSmallAlert Informative" = "Legalább %2$@ tárkapacitású SD-kártya vagy USB-memória szükséges.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "A(z) %1$@ nem használható, mert írásvédett.";
"NotWritable Informative" = "Az SD-kártya vagy USB-memória nem írható. Lehet, hogy van rajta egy kapcsoló, amellyel megszüntetheti az írásvédettséget, azonban ennek hiányában nem fogja tudni használni.";
"NotWritable OK" = "OK";

"Label SD Card" = "SD-kártya";

/* Stick writing statuses. */
"Status Downloading" = "Letöltés…";
"Status Verifying Image" = "A helyreállítási kép ellenőrzése folyamatban…";
"Status Unpacking" = "Kicsomagolás…";
"Status Claiming" = "Lefoglalás…";
"Status Unmounting" = "Leválasztás…";
"Status Writing" = "Írás…";
"Status Verifying Media" = "A helyreállító adathordozó ellenőrzése folyamatban…";
"Status Ejecting" = "Kiadás…";
"Status Done" = "Kész!";

"StatusAdd Attempt" = " (%1$d. kísérlet)";

/* Errors */
"Failure Downloading" = "Elnézést kérünk, valami hiba történt (nem sikerült letölteni a forrásképet). Megpróbálja újra?";
"Failure Verifying Return Value" = "Elnézést kérünk, valami hiba történt (nem sikerült a forráskép ellenőrzése, programhiba, %1$s). Megpróbálja újra?";
"Failure Verifying SHA Mismatch" = "Elnézést kérünk, valami hiba történt (nem sikerült a forráskép ellenőrzése, ellenőrzőösszeg-hiba). Megpróbálja újra?";
"Failure Unpacking" = "Elnézést kérünk, valami hiba történt (nem sikerült kicsomagolni a forrásképet, %1$s). Megpróbálja újra?";
"Failure Claiming" = "Elnézést kérünk, valami hiba történt (nem sikerült lefoglalni az USB-eszközt). Megpróbálja újra?";
"Failure Unmounting" = "Elnézést kérünk, valami hiba történt (nem sikerült lecsatolni az USB-eszközt). Megpróbálja újra?";
"Failure Opening Source Image" = "Elnézést kérünk, valami hiba történt (nem sikerült megnyitni a forrásképet, %1$s). Megpróbálja újra?";
"Failure Opening Destination Device" = "Elnézést kérünk, valami hiba történt (nem sikerült megnyitni az USB-eszközt, %1$s). Megpróbálja újra?";
"Failure Reading Source Image" = "Elnézést kérünk, valami hiba történt (nem sikerült beolvasni a forrásképadatokat, %1$s). Megpróbálja újra?";
"Failure Writing Destination Device" = "Elnézést kérünk, valami hiba történt (nem sikerült adatokat írni az USB-eszközre, %1$s). Megpróbálja újra?";
"Failure Reading Destination Device" = "Sajnos hiba történt (nem sikerült az USB-memóriát olvasni: %1$s). Megpróbálja újra?";
"Failure Resetting Source Image" = "Sajnos hiba történt (nem sikerült visszaállítani a forrásképet: %1$s). Megpróbálja újra?";
"Failure Resetting Destination Device" = "Sajnos hiba történt (nem sikerült visszaállítani az USB-memóriát: %1$s). Megpróbálja újra?";
"Failure Ejecting" = "Elnézést kérünk, valami hiba történt (nem sikerült kiadni az USB-eszközt). Megpróbálja újra?";

"Failure Try Again" = "Újrapróbálkozás";
"Failure Quit" = "Kilépés";

"Failure Termination Status" = "Leállítás állapota: %d";

"Failure Internal Error 1" = "Nem várt fájlbefejezés";
